examples/lid_driven_cavity/setup_files/openfoam2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     coconut_pimpleFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         1e15;

deltaT          0.01;

writeControl    timeStep;

writeInterval   1;

purgeWrite      10;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      fixed;

timePrecision   3;

runTimeModifiable false;

adjustTimeStep  no;


// ************************************************************************* //
