examples/lid_driven_cavity/setup_files/openfoam2d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//cavity geometry variables

D 0.5;
nD #calc "-$D";

vertices
(
    (0 0 $nD) //0
    (1 0 $nD) //1
    (1 0.875 $nD) //2
    (1 1 $nD) //3
    (0 1 $nD) //4
    (0 0.875 $nD) //5
    (0 0 $D) //6
    (1 0 $D) //7
    (1 0.875 $D) //8
    (1 1 $D) //9
    (0 1 $D) //10
    (0 0.875 $D) //11
);

blocks
(
    hex (0 1 2 5 6 7 8 11) (32 28 1) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (32 4 1) simpleGrading (1 1 1)
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 6 11 5)
            (1 2 8 7)
            
        );
    }

    bottom
    {
        type   wall;
        faces  ((0 1 7 6));
    }

    inlet
    {
        type patch;
        faces ((5 11 10 4));
    }

    topInlet
    {
        type patch;
        faces ((4 10 9 3));
    }

    outlet
    {
        type patch;
        faces ((2 3 9 8));
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 2 1)
            (6 7 8 11)
            (5 4 3 2)
            (11 8 9 10)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
