examples/lid_driven_cavity/setup_files/openfoam2d/0/include/inlet_parameters

scalar t_ramp = 0.0;
bool unsteady_flag = true;
